In [3]:

people = {
    'First' : ['Jasim', 'Shanto', 'Abdur', 'Jewel'],
    'Last'  : ['Uddin', 'Rahman', 'Rahim', 'Mahmud'],
    'Email' : ['jasimcse@gmail.com', 'shantocse@gmail.com', 'rahimcse@gmail.com', 'jewelcse@gmail.com']
}

In [5]:
import pandas as pd

In [6]:
df = pd.DataFrame(people)

In [7]:
df

    First    Last                Email
0   Jasim   Uddin   jasimcse@gmail.com
1  Shanto  Rahman  shantocse@gmail.com
2   Abdur   Rahim   rahimcse@gmail.com
3   Jewel  Mahmud   jewelcse@gmail.com

In [8]:
df['First']+ ' ' + df['Last']

0      Jasim Uddin
1    Shanto Rahman
2      Abdur Rahim
3     Jewel Mahmud
dtype: object

In [11]:
df['fullname'] = df['First']+ ' ' + df['Last']

In [34]:
#df.columns = ['first','last', 'email', 'fullname']
df.rename(columns = {'First': 'first', 'Last': 'last'}, inplace=True)

In [38]:
df

    first    last                email       fullname
0   Jasim   Uddin   jasimcse@gmail.com    Jasim Uddin
1  Shanto  Rahman  shantocse@gmail.com  Shanto Rahman
2   Abdur   Rahim   rahimcse@gmail.com    Abdur Rahim
3   Jewel  Mahmud   jewelcse@gmail.com   Jewel Mahmud

In [39]:
#df.drop(columns = 'last')

In [51]:
df.drop(columns = ['first', 'last'], inplace = True)

In [52]:
df['fullname'].str.split(' ', expand =True)

        0       1
0   Jasim   Uddin
1  Shanto  Rahman
2   Abdur   Rahim
3   Jewel  Mahmud

In [53]:
df[['first', 'last']] = df['fullname'].str.split(' ', expand =True)

In [54]:
df

                 email       fullname   first    last
0   jasimcse@gmail.com    Jasim Uddin   Jasim   Uddin
1  shantocse@gmail.com  Shanto Rahman  Shanto  Rahman
2   rahimcse@gmail.com    Abdur Rahim   Abdur   Rahim
3   jewelcse@gmail.com   Jewel Mahmud   Jewel  Mahmud

In [57]:
df.append({'first': 'Tamim','last':'Dari', 'fullname': 'Tamim Dari', 'email': 'tamimcse@gmail.com'}, ignore_index = True)

                 email       fullname   first    last
0   jasimcse@gmail.com    Jasim Uddin   Jasim   Uddin
1  shantocse@gmail.com  Shanto Rahman  Shanto  Rahman
2   rahimcse@gmail.com    Abdur Rahim   Abdur   Rahim
3   jewelcse@gmail.com   Jewel Mahmud   Jewel  Mahmud
4   tamimcse@gmail.com     Tamim Dari   Tamim    Dari

In [62]:
people = {
    'first' : ['Jany', 'Shafiq'],
    'last'  : ['jay', 'Rahman'],
    'email' : ['janycse@gmail.com','shafiqcse@gmail.com']
}

In [63]:
df2 = pd.DataFrame(people)

In [64]:
df2

    first    last                email
0    Jany     jay    janycse@gmail.com
1  Shafiq  Rahman  shafiqcse@gmail.com

In [67]:
df.append(df2, ignore_index = True)

TypeError: append() got an unexpected keyword argument 'inplace'